engduino/Engduino_v3.0_release/hardware/arduino/boards.txt
# See: http://code.google.com/p/arduino/wiki/Platforms


##############################################################

Engduinov3.name=EngduinoV3
Engduinov3.upload.protocol=avr109
Engduinov3.upload.maximum_size=28672
Engduinov3.upload.speed=57600
Engduinov3.upload.disable_flushing=true
Engduinov3.bootloader.low_fuses=0xff
Engduinov3.bootloader.high_fuses=0xd8
Engduinov3.bootloader.extended_fuses=0xCB
Engduinov3.bootloader.path=caterina-LilyPadUSB
Engduinov3.bootloader.file=Caterina-LilyPadUSB.hex
Engduinov3.bootloader.unlock_bits=0x3F
Engduinov3.bootloader.lock_bits=0x2F
Engduinov3.build.mcu=atmega32u4
Engduinov3.build.f_cpu=8000000L
Engduinov3.build.vid=0x1B4F
Engduinov3.build.pid=0x9208
Engduinov3.build.core=arduino
Engduinov3.build.variant=engduinov3

##############################################################

Engduinov2.name=EngduinoV2
Engduinov2.upload.protocol=avr109
Engduinov2.upload.maximum_size=28672
Engduinov2.upload.speed=57600
Engduinov2.upload.disable_flushing=true
Engduinov2.bootloader.low_fuses=0xff
Engduinov2.bootloader.high_fuses=0xd8
Engduinov2.bootloader.extended_fuses=0xCB
Engduinov2.bootloader.path=caterina-LilyPadUSB
Engduinov2.bootloader.file=Caterina-LilyPadUSB.hex
Engduinov2.bootloader.unlock_bits=0x3F
Engduinov2.bootloader.lock_bits=0x2F
Engduinov2.build.mcu=atmega32u4
Engduinov2.build.f_cpu=8000000L
Engduinov2.build.vid=0x1B4F
Engduinov2.build.pid=0x9208
Engduinov2.build.core=arduino
Engduinov2.build.variant=engduinov2
##############################################################

Engduinov1.name=EngduinoV1
Engduinov1.upload.protocol=avr109
Engduinov1.upload.maximum_size=28672
Engduinov1.upload.speed=57600
Engduinov1.upload.disable_flushing=true
Engduinov1.bootloader.low_fuses=0xff
Engduinov1.bootloader.high_fuses=0xd8
Engduinov1.bootloader.extended_fuses=0xCB
Engduinov1.bootloader.path=caterina-LilyPadUSB
Engduinov1.bootloader.file=Caterina-LilyPadUSB.hex
Engduinov1.bootloader.unlock_bits=0x3F
Engduinov1.bootloader.lock_bits=0x2F
Engduinov1.build.mcu=atmega32u4
Engduinov1.build.f_cpu=8000000L
Engduinov1.build.vid=0x1B4F
Engduinov1.build.pid=0x9208
Engduinov1.build.core=arduino
Engduinov1.build.variant=engduinov1

## Uncomment the hash tags at the beginning to use these boards
##############################################################

#uno.name=Arduino Uno
#uno.upload.protocol=arduino
#uno.upload.maximum_size=32256
#uno.upload.speed=115200
#uno.bootloader.low_fuses=0xff
#uno.bootloader.high_fuses=0xde
#uno.bootloader.extended_fuses=0x05
#uno.bootloader.path=optiboot
#uno.bootloader.file=optiboot_atmega328.hex
#uno.bootloader.unlock_bits=0x3F
#uno.bootloader.lock_bits=0x0F
#uno.build.mcu=atmega328p
#uno.build.f_cpu=16000000L
#uno.build.core=arduino
#uno.build.variant=standard

##############################################################

#atmega328.name=Arduino Duemilanove w/ ATmega328

#atmega328.upload.protocol=arduino
#atmega328.upload.maximum_size=30720
#atmega328.upload.speed=57600

#atmega328.bootloader.low_fuses=0xFF
#atmega328.bootloader.high_fuses=0xDA
#atmega328.bootloader.extended_fuses=0x05
#atmega328.bootloader.path=atmega
#atmega328.bootloader.file=ATmegaBOOT_168_atmega328.hex
#atmega328.bootloader.unlock_bits=0x3F
#atmega328.bootloader.lock_bits=0x0F

#atmega328.build.mcu=atmega328p
#atmega328.build.f_cpu=16000000L
#atmega328.build.core=arduino
#atmega328.build.variant=standard

##############################################################

#diecimila.name=Arduino Diecimila or Duemilanove w/ ATmega168

#diecimila.upload.protocol=arduino
#diecimila.upload.maximum_size=14336
#diecimila.upload.speed=19200

#diecimila.bootloader.low_fuses=0xff
#diecimila.bootloader.high_fuses=0xdd
#diecimila.bootloader.extended_fuses=0x00
#diecimila.bootloader.path=atmega
#diecimila.bootloader.file=ATmegaBOOT_168_diecimila.hex
#diecimila.bootloader.unlock_bits=0x3F
#diecimila.bootloader.lock_bits=0x0F

#diecimila.build.mcu=atmega168
#diecimila.build.f_cpu=16000000L
#diecimila.build.core=arduino
#diecimila.build.variant=standard

##############################################################

#nano328.name=Arduino Nano w/ ATmega328

#nano328.upload.protocol=arduino
#nano328.upload.maximum_size=30720
#nano328.upload.speed=57600

#nano328.bootloader.low_fuses=0xFF
#nano328.bootloader.high_fuses=0xDA
#nano328.bootloader.extended_fuses=0x05
#nano328.bootloader.path=atmega
#nano328.bootloader.file=ATmegaBOOT_168_atmega328.hex
#nano328.bootloader.unlock_bits=0x3F
#nano328.bootloader.lock_bits=0x0F

#nano328.build.mcu=atmega328p
#nano328.build.f_cpu=16000000L
#nano328.build.core=arduino
#nano328.build.variant=eightanaloginputs

##############################################################

#nano.name=Arduino Nano w/ ATmega168

#nano.upload.protocol=arduino
#nano.upload.maximum_size=14336
#nano.upload.speed=19200

#nano.bootloader.low_fuses=0xff
#nano.bootloader.high_fuses=0xdd
#nano.bootloader.extended_fuses=0x00
#nano.bootloader.path=atmega
#nano.bootloader.file=ATmegaBOOT_168_diecimila.hex
#nano.bootloader.unlock_bits=0x3F
#nano.bootloader.lock_bits=0x0F

#nano.build.mcu=atmega168
#nano.build.f_cpu=16000000L
#nano.build.core=arduino
#nano.build.variant=eightanaloginputs

##############################################################

#mega2560.name=Arduino Mega 2560 or Mega ADK

#mega2560.upload.protocol=wiring
#mega2560.upload.maximum_size=258048
#mega2560.upload.speed=115200

#mega2560.bootloader.low_fuses=0xFF
#mega2560.bootloader.high_fuses=0xD8
#mega2560.bootloader.extended_fuses=0xFD
#mega2560.bootloader.path=stk500v2
#mega2560.bootloader.file=stk500boot_v2_mega2560.hex
#mega2560.bootloader.unlock_bits=0x3F
#mega2560.bootloader.lock_bits=0x0F

#mega2560.build.mcu=atmega2560
#mega2560.build.f_cpu=16000000L
#mega2560.build.core=arduino
#mega2560.build.variant=mega

##############################################################

#mega.name=Arduino Mega (ATmega1280)

#mega.upload.protocol=arduino
#mega.upload.maximum_size=126976
#mega.upload.speed=57600

#mega.bootloader.low_fuses=0xFF
#mega.bootloader.high_fuses=0xDA
#mega.bootloader.extended_fuses=0xF5
#mega.bootloader.path=atmega
#mega.bootloader.file=ATmegaBOOT_168_atmega1280.hex
#mega.bootloader.unlock_bits=0x3F
#mega.bootloader.lock_bits=0x0F

#mega.build.mcu=atmega1280
#mega.build.f_cpu=16000000L
#mega.build.core=arduino
#mega.build.variant=mega

