engduino/Engduino_v3.0_release/hardware/arduino/boards.txt
##############################################################

#leonardo.name=Arduino Leonardo
#leonardo.upload.protocol=avr109
#leonardo.upload.maximum_size=28672
#leonardo.upload.speed=57600
#leonardo.upload.disable_flushing=true
#leonardo.bootloader.low_fuses=0xff
#leonardo.bootloader.high_fuses=0xd8
#leonardo.bootloader.extended_fuses=0xcb
#leonardo.bootloader.path=caterina
#leonardo.bootloader.file=Caterina-Leonardo.hex
#leonardo.bootloader.unlock_bits=0x3F
#leonardo.bootloader.lock_bits=0x2F
#leonardo.build.mcu=atmega32u4
#leonardo.build.f_cpu=16000000L
#leonardo.build.vid=0x2341
#leonardo.build.pid=0x8036
#leonardo.build.core=arduino
#leonardo.build.variant=leonardo

##############################################################

#esplora.name=Arduino Esplora
#esplora.upload.protocol=avr109
#esplora.upload.maximum_size=28672
#esplora.upload.speed=57600
#esplora.upload.disable_flushing=true
#esplora.bootloader.low_fuses=0xff
#esplora.bootloader.high_fuses=0xd8
#esplora.bootloader.extended_fuses=0xcb
#esplora.bootloader.path=caterina
#esplora.bootloader.file=Caterina-Esplora.hex
#esplora.bootloader.unlock_bits=0x3F
#esplora.bootloader.lock_bits=0x2F
#esplora.build.mcu=atmega32u4
#esplora.build.f_cpu=16000000L
#esplora.build.vid=0x2341
#esplora.build.pid=0x803C
#esplora.build.core=arduino
#esplora.build.variant=leonardo

##############################################################

#micro.name=Arduino Micro
#micro.upload.protocol=avr109
#micro.upload.maximum_size=28672
#micro.upload.speed=57600
#micro.upload.disable_flushing=true
#micro.bootloader.low_fuses=0xff
#micro.bootloader.high_fuses=0xd8
#micro.bootloader.extended_fuses=0xcb
#micro.bootloader.path=caterina
#micro.bootloader.file=Caterina-Micro.hex
#micro.bootloader.unlock_bits=0x3F
#micro.bootloader.lock_bits=0x2F
#micro.build.mcu=atmega32u4
#micro.build.f_cpu=16000000L
#micro.build.vid=0x2341
#micro.build.pid=0x8037
#micro.build.core=arduino
#micro.build.variant=micro

##############################################################

#mini328.name=Arduino Mini w/ ATmega328

#mini328.upload.protocol=arduino
#mini328.upload.maximum_size=28672
#mini328.upload.speed=115200

#mini328.bootloader.low_fuses=0xff
#mini328.bootloader.high_fuses=0xd8
#mini328.bootloader.extended_fuses=0x05
#mini328.bootloader.path=optiboot
#mini328.bootloader.file=optiboot_atmega328-Mini.hex
#mini328.bootloader.unlock_bits=0x3F
#mini328.bootloader.lock_bits=0x0F

#mini328.build.mcu=atmega328p
#mini328.build.f_cpu=16000000L
#mini328.build.core=arduino
#mini328.build.variant=eightanaloginputs

##############################################################

#mini.name=Arduino Mini w/ ATmega168

#mini.upload.protocol=arduino
#mini.upload.maximum_size=14336
#mini.upload.speed=19200

#mini.bootloader.low_fuses=0xff
#mini.bootloader.high_fuses=0xdd
#mini.bootloader.extended_fuses=0x00
#mini.bootloader.path=atmega
#mini.bootloader.file=ATmegaBOOT_168_ng.hex
#mini.bootloader.unlock_bits=0x3F
#mini.bootloader.lock_bits=0x0F

#mini.build.mcu=atmega168
#mini.build.f_cpu=16000000L
#mini.build.core=arduino
#mini.build.variant=eightanaloginputs

##############################################################

#ethernet.name=Arduino Ethernet

#ethernet.upload.protocol=arduino
#ethernet.upload.maximum_size=32256
#ethernet.upload.speed=115200

#ethernet.bootloader.low_fuses=0xff
#ethernet.bootloader.high_fuses=0xde
#ethernet.bootloader.extended_fuses=0x05
#ethernet.bootloader.path=optiboot
#ethernet.bootloader.file=optiboot_atmega328.hex
#ethernet.bootloader.unlock_bits=0x3F
#ethernet.bootloader.lock_bits=0x0F

#ethernet.build.variant=standard
#ethernet.build.mcu=atmega328p
#ethernet.build.f_cpu=16000000L
#ethernet.build.core=arduino

##############################################################

#fio.name=Arduino Fio

#fio.upload.protocol=arduino
#fio.upload.maximum_size=30720
#fio.upload.speed=57600

#fio.bootloader.low_fuses=0xFF
#fio.bootloader.high_fuses=0xDA
#fio.bootloader.extended_fuses=0x05
#fio.bootloader.path=arduino:atmega
#fio.bootloader.file=ATmegaBOOT_168_atmega328_pro_8MHz.hex
#fio.bootloader.unlock_bits=0x3F
#fio.bootloader.lock_bits=0x0F

#fio.build.mcu=atmega328p
#fio.build.f_cpu=8000000L
#fio.build.core=arduino
#fio.build.variant=eightanaloginputs

##############################################################

#bt328.name=Arduino BT w/ ATmega328

#bt328.upload.protocol=arduino
#bt328.upload.maximum_size=28672
#bt328.upload.speed=19200
#bt328.upload.disable_flushing=true

#bt328.bootloader.low_fuses=0xff
#bt328.bootloader.high_fuses=0xd8
#bt328.bootloader.extended_fuses=0x05
#bt328.bootloader.path=bt
#bt328.bootloader.file=ATmegaBOOT_168_atmega328_bt.hex
#bt328.bootloader.unlock_bits=0x3F
#bt328.bootloader.lock_bits=0x0F

#bt328.build.mcu=atmega328p
#bt328.build.f_cpu=16000000L
#bt328.build.core=arduino
#bt328.build.variant=eightanaloginputs

##############################################################

#bt.name=Arduino BT w/ ATmega168

#bt.upload.protocol=arduino
#bt.upload.maximum_size=14336
#bt.upload.speed=19200
#bt.upload.disable_flushing=true

#bt.bootloader.low_fuses=0xff
#bt.bootloader.high_fuses=0xdd
#bt.bootloader.extended_fuses=0x00
#bt.bootloader.path=bt
#bt.bootloader.file=ATmegaBOOT_168.hex
#bt.bootloader.unlock_bits=0x3F
#bt.bootloader.lock_bits=0x0F

#bt.build.mcu=atmega168
#bt.build.f_cpu=16000000L
#bt.build.core=arduino
#bt.build.variant=eightanaloginputs

##############################################################

#LilyPadUSB.name=LilyPad Arduino USB
#LilyPadUSB.upload.protocol=avr109
#LilyPadUSB.upload.maximum_size=28672
#LilyPadUSB.upload.speed=57600
#LilyPadUSB.upload.disable_flushing=true
#LilyPadUSB.bootloader.low_fuses=0xff
#LilyPadUSB.bootloader.high_fuses=0xd8
#LilyPadUSB.bootloader.extended_fuses=0xce
#LilyPadUSB.bootloader.path=caterina-LilyPadUSB
#LilyPadUSB.bootloader.file=Caterina-LilyPadUSB.hex
#LilyPadUSB.bootloader.unlock_bits=0x3F
#LilyPadUSB.bootloader.lock_bits=0x2F
#LilyPadUSB.build.mcu=atmega32u4
#LilyPadUSB.build.f_cpu=8000000L
#LilyPadUSB.build.vid=0x1B4F
#LilyPadUSB.build.pid=0x9208
#LilyPadUSB.build.core=arduino
#LilyPadUSB.build.variant=leonardo

