engduino/Engduino_v3.0_release/hardware/arduino/boards.txt
##############################################################

#lilypad328.name=LilyPad Arduino w/ ATmega328

#lilypad328.upload.protocol=arduino
#lilypad328.upload.maximum_size=30720
#lilypad328.upload.speed=57600

#lilypad328.bootloader.low_fuses=0xFF
#lilypad328.bootloader.high_fuses=0xDA
#lilypad328.bootloader.extended_fuses=0x05
#lilypad328.bootloader.path=atmega
#lilypad328.bootloader.file=ATmegaBOOT_168_atmega328_pro_8MHz.hex
#lilypad328.bootloader.unlock_bits=0x3F
#lilypad328.bootloader.lock_bits=0x0F

#lilypad328.build.mcu=atmega328p
#lilypad328.build.f_cpu=8000000L
#lilypad328.build.core=arduino
#lilypad328.build.variant=standard

##############################################################

#lilypad.name=LilyPad Arduino w/ ATmega168

#lilypad.upload.protocol=arduino
#lilypad.upload.maximum_size=14336
#lilypad.upload.speed=19200

#lilypad.bootloader.low_fuses=0xe2
#lilypad.bootloader.high_fuses=0xdd
#lilypad.bootloader.extended_fuses=0x00
#lilypad.bootloader.path=lilypad
#lilypad.bootloader.file=LilyPadBOOT_168.hex
#lilypad.bootloader.unlock_bits=0x3F
#lilypad.bootloader.lock_bits=0x0F

#lilypad.build.mcu=atmega168
#lilypad.build.f_cpu=8000000L
#lilypad.build.core=arduino
#lilypad.build.variant=standard

##############################################################

#pro5v328.name=Arduino Pro or Pro Mini (5V, 16 MHz) w/ ATmega328

#pro5v328.upload.protocol=arduino
#pro5v328.upload.maximum_size=30720
#pro5v328.upload.speed=57600

#pro5v328.bootloader.low_fuses=0xFF
#pro5v328.bootloader.high_fuses=0xDA
#pro5v328.bootloader.extended_fuses=0x05
#pro5v328.bootloader.path=atmega
#pro5v328.bootloader.file=ATmegaBOOT_168_atmega328.hex
#pro5v328.bootloader.unlock_bits=0x3F
#pro5v328.bootloader.lock_bits=0x0F

#pro5v328.build.mcu=atmega328p
#pro5v328.build.f_cpu=16000000L
#pro5v328.build.core=arduino
#pro5v328.build.variant=standard

##############################################################

#pro5v.name=Arduino Pro or Pro Mini (5V, 16 MHz) w/ ATmega168

#pro5v.upload.protocol=arduino
#pro5v.upload.maximum_size=14336
#pro5v.upload.speed=19200

#pro5v.bootloader.low_fuses=0xff
#pro5v.bootloader.high_fuses=0xdd
#pro5v.bootloader.extended_fuses=0x00
#pro5v.bootloader.path=atmega
#pro5v.bootloader.file=ATmegaBOOT_168_diecimila.hex
#pro5v.bootloader.unlock_bits=0x3F
#pro5v.bootloader.lock_bits=0x0F

#pro5v.build.mcu=atmega168
#pro5v.build.f_cpu=16000000L
#pro5v.build.core=arduino
#pro5v.build.variant=standard

##############################################################

#pro328.name=Arduino Pro or Pro Mini (3.3V, 8 MHz) w/ ATmega328

#pro328.upload.protocol=arduino
#pro328.upload.maximum_size=30720
#pro328.upload.speed=57600

#pro328.bootloader.low_fuses=0xFF
#pro328.bootloader.high_fuses=0xDA
#pro328.bootloader.extended_fuses=0x05
#pro328.bootloader.path=atmega
#pro328.bootloader.file=ATmegaBOOT_168_atmega328_pro_8MHz.hex
#pro328.bootloader.unlock_bits=0x3F
#pro328.bootloader.lock_bits=0x0F

#pro328.build.mcu=atmega328p
#pro328.build.f_cpu=8000000L
#pro328.build.core=arduino
#pro328.build.variant=standard

##############################################################

#pro.name=Arduino Pro or Pro Mini (3.3V, 8 MHz) w/ ATmega168

#pro.upload.protocol=arduino
#pro.upload.maximum_size=14336
#pro.upload.speed=19200

#pro.bootloader.low_fuses=0xc6
#pro.bootloader.high_fuses=0xdd
#pro.bootloader.extended_fuses=0x00
#pro.bootloader.path=atmega
#pro.bootloader.file=ATmegaBOOT_168_pro_8MHz.hex
#pro.bootloader.unlock_bits=0x3F
#pro.bootloader.lock_bits=0x0F

#pro.build.mcu=atmega168
#pro.build.f_cpu=8000000L
#pro.build.core=arduino
#pro.build.variant=standard

##############################################################

#atmega168.name=Arduino NG or older w/ ATmega168

#atmega168.upload.protocol=arduino
#atmega168.upload.maximum_size=14336
#atmega168.upload.speed=19200

#atmega168.bootloader.low_fuses=0xff
#atmega168.bootloader.high_fuses=0xdd
#atmega168.bootloader.extended_fuses=0x00
#atmega168.bootloader.path=atmega
#atmega168.bootloader.file=ATmegaBOOT_168_ng.hex
#atmega168.bootloader.unlock_bits=0x3F
#atmega168.bootloader.lock_bits=0x0F

#atmega168.build.mcu=atmega168
#atmega168.build.f_cpu=16000000L
#atmega168.build.core=arduino
#atmega168.build.variant=standard

##############################################################

#atmega8.name=Arduino NG or older w/ ATmega8

#atmega8.upload.protocol=arduino
#atmega8.upload.maximum_size=7168
#atmega8.upload.speed=19200

#atmega8.bootloader.low_fuses=0xdf
#atmega8.bootloader.high_fuses=0xca
#atmega8.bootloader.path=atmega8
#atmega8.bootloader.file=ATmegaBOOT-prod-firmware-2009-11-07.hex
#atmega8.bootloader.unlock_bits=0x3F
#atmega8.bootloader.lock_bits=0x0F

#atmega8.build.mcu=atmega8
#atmega8.build.f_cpu=16000000L
#atmega8.build.core=arduino
#atmega8.build.variant=standard

##############################################################

#robotControl.name=Arduino Robot Control
#robotControl.upload.protocol=avr109
#robotControl.upload.maximum_size=28672
#robotControl.upload.speed=57600
#robotControl.upload.disable_flushing=true
#robotControl.bootloader.low_fuses=0xff
#robotControl.bootloader.high_fuses=0xd8
#robotControl.bootloader.extended_fuses=0xcb
#robotControl.bootloader.path=caterina-Arduino_Robot
#robotControl.bootloader.file=Caterina-Robot-Control.hex
#robotControl.bootloader.unlock_bits=0x3F
#robotControl.bootloader.lock_bits=0x2F
#robotControl.build.mcu=atmega32u4
#robotControl.build.f_cpu=16000000L
#robotControl.build.vid=0x2341
#robotControl.build.pid=0x8038
#robotControl.build.core=robot
#robotControl.build.variant=robot_control

##############################################################

#robotMotor.name=Arduino Robot Motor
#robotMotor.upload.protocol=avr109
#robotMotor.upload.maximum_size=28672
#robotMotor.upload.speed=57600
#robotMotor.upload.disable_flushing=true
#robotMotor.bootloader.low_fuses=0xff
#robotMotor.bootloader.high_fuses=0xd8
#robotMotor.bootloader.extended_fuses=0xcb
#robotMotor.bootloader.path=caterina-Arduino_Robot
#robotMotor.bootloader.file=Caterina-Robot-Motor.hex
#robotMotor.bootloader.unlock_bits=0x3F
#robotMotor.bootloader.lock_bits=0x2F
#robotMotor.build.mcu=atmega32u4
#robotMotor.build.f_cpu=16000000L
#robotMotor.build.vid=0x2341
#robotMotor.build.pid=0x8039
#robotMotor.build.core=robot
#robotMotor.build.variant=robot_motor

